# Config
cask_args appdir: '/Applications'


# Add repositories
tap 'homebrew/cask'

#tap 'railwaycat/emacsmacport'
tap 'd12frosted/emacs-plus'
tap 'noborus/tap'
tap 'iandol/adobe-fonts'


# Install requirements and dependencies
brew 'git'
brew 'git-lfs'
brew 'openjdk'
brew 'zsh'

brew 'cmake'
brew 'dbus', restart_service: true
brew 'texinfo'

cask 'xquartz'
cask '1password'
cask '1password-cli'

# Homebrew packages
brew 'atool'
brew 'clamav'
brew 'cmigemo'
brew 'doxygen'
brew 'editorconfig'
#brew 'emacs-mac', args: ['with-dbus', 'with-glib', 'with-imagemagick', 'with-jansson', 'with-libxml2', 'with-rsvg', 'with-mac-metal', 'with-native-comp', 'with-natural-title-bar', 'with-starter', 'with-emacs-sexy-icon', 'with-xwidgets', 'with-unlimited-select']
brew 'emacs-plus@31', args: ['with-compress-install', 'with-dbus', 'with-xwidgets']
brew 'eza'
brew 'ffmpeg'
brew 'fd'
brew 'flow'
brew 'gibo'
brew 'git-when-merged'
brew 'gnu-sed'
brew 'gnu-tar'
brew 'grep'
brew 'gnupg'
brew 'hunspell'
brew 'jq'
brew 'mas'
brew 'ov'
brew 'p7zip'
brew 'pandoc'
brew 'peco'
brew 'pinentry-mac'
brew 'plantuml'
brew 'reattach-to-user-namespace'
brew 'rename'
brew 'ripgrep'
brew 'rsync'
brew 'source-highlight'
brew 'ssh-copy-id'
brew 'svn'
brew 'terminal-notifier'
brew 'the_silver_searcher'
brew 'tidy-html5'
brew 'tmux'
brew 'unar'
brew 'universal-ctags'
brew 'wget'

## for Worksite
brew 'awscli'

brew 'isync'
brew 'msmtp'
brew 'gmime'
brew 'xapian'
brew 'mu', args: ['ignore-dependencies']

brew 'putty'
brew 'telnet'

brew 'php'
brew 'composer', args: ['ignore-dependencies']
brew 'phpstan'

# Homebrew Cask apps
cask 'alfred'
cask 'appcleaner'
cask 'basictex'
cask 'betterzip'
cask 'firefox'
cask 'dash'
cask 'dropbox'
cask 'google-drive'
cask 'handbrake'
cask 'iina'
cask 'karabiner-elements'
cask 'macwinzipper'
cask 'notion'
cask 'notion-calendar'
cask 'onyx'
cask 'qlmarkdown'
cask 'quicklook-csv'
cask 'spotify'
cask 'suspicious-package'
cask 'syntax-highlight'
cask 'yacreader'

## for Worksite
cask 'google-chrome'
cask 'docker'
cask 'microsoft-edge'
cask 'slack'
cask 'utm'
cask 'webex'


# Homebrew Cask Fonts
cask 'font-fontawesome'
cask 'font-ricty-diminished'
cask 'font-source-code-pro'
cask 'font-source-han-code-jp'
cask 'font-udev-gothic'

cask 'font-ipafont'
cask 'font-ipaexfont'
